; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	spectrograph1 - mode
	infrared2 - mode
	infrared0 - mode
	GroundStation10 - direction
	GroundStation9 - direction
	GroundStation6 - direction
	Star8 - direction
	Star5 - direction
	Star7 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star11 - direction
	GroundStation12 - direction
	Star0 - direction
	GroundStation13 - direction
	GroundStation2 - direction
	Planet14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation9)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 Star5)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star11)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star17)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation13)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 GroundStation12)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star15)
)
(:goal (and
	(have_image Planet14 infrared2)
	(have_image Star15 spectrograph1)
	(have_image Phenomenon16 spectrograph1)
	(have_image Star17 infrared0)
))

)

; plan
1. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 4
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
3. (turn_to satellite1 star0 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star0)
   goals met: 0 of 4
4. (calibrate satellite1 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 0 of 4
5. (turn_to satellite1 phenomenon16 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon16)
   goals met: 0 of 4
6. (take_image satellite1 phenomenon16 instrument4 spectrograph1)
   added: (have_image phenomenon16 spectrograph1)
   goals met: 1 of 4
7. (turn_to satellite1 planet14 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet14)
   goals met: 1 of 4
8. (take_image satellite1 planet14 instrument4 infrared2)
   added: (have_image planet14 infrared2)
   goals met: 2 of 4
9. (turn_to satellite1 star15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star15)
   goals met: 2 of 4
10. (take_image satellite1 star15 instrument4 spectrograph1)
   added: (have_image star15 spectrograph1)
   goals met: 3 of 4
11. (turn_to satellite0 groundstation9 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 groundstation9)
   goals met: 3 of 4
12. (calibrate satellite0 instrument0 groundstation9)
   added: (calibrated instrument0)
   goals met: 3 of 4
13. (turn_to satellite0 star17 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 star17)
   goals met: 3 of 4
14. (take_image satellite0 star17 instrument0 infrared0)
   added: (have_image star17 infrared0)
   goals met: 4 of 4
